# Metadata
author: Y-T-G
task: detect
keywords: [cnn, yolo11, large-object]
description: YOLO11 detection model with an extra P6 scale for large object detecton.
flops:
  n: 7.0
  s: 23.2
  m: 70.5
  l: 90.3
  x: 202.1
parameters:
  n: 4391920
  s: 16130064
  m: 30063504
  l: 37883024
  x: 85074352
min_version: 8.3.0
discussion: https://github.com/Y-T-G/community/discussions/69

# Model
nc: 80
strides: [8, 16, 32, 64]
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ===== Backbone =====
backbone:
  - [-1, 1, Conv, [64, 3, 2]]                        # 0: 1/2
  - [-1, 1, Conv, [128, 3, 2]]                       # 1: 1/4
  - [-1, 2, C3k2, [256, False, 0.25]]                # 2: 1/4
  - [-1, 1, Conv, [256, 3, 2]]                       # 3: 1/8
  - [-1, 2, C3k2, [512, False, 0.25]]                # 4: 1/8
  - [-1, 1, Conv, [512, 3, 2]]                       # 5: 1/16
  - [-1, 2, C3k2, [768, False]]              # 6: 1/16
  - [-1, 1, Conv, [768, 3, 2]]                       # 7: 1/32
  - [-1, 2, C3k2, [768, False]]              # 8: 1/32
  - [-1, 1, Conv, [960, 3, 2]]                      # 9: 1/64
  - [-1, 2, C3k2, [960, False]]             # 10: 1/64
  - [-1, 1, SPPF, [960, 5]]                         # 11: 1/64
  - [-1, 2, C2PSA, [960]]                           # 12: 1/64 (P6 base)
  - [-1, 1, Conv, [1024, 3, 2, 1]]                   # 13: 1/128 (P7 base)
  - [-1, 2, C3k2_StarGate, [1024, False]]             # 14: 1/128 (P7)

# ===== Head =====
head:
# --- P7 -> P6 융합 (안전 정렬) ---
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]       # 15: P7 1/128 → 1/64 (대략 맞춤)
  - [[15, 12], 1, ResizeTo, ["nearest"]]             # 16: P7↑를 P6(12)의 H×W로 '정확히' 맞춤
  - [[12, 16], 1, Concat, [1]]                       # 17: P6 + (정렬된)P7↑
  - [-1, 1, C3k2, [960, False]]                      # 18: P6 fused (1/64)

# --- Top-Down (FPN) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 19: 1/64 → 1/32
  - [[-1, 8], 1, Concat, [1]]                        # 20: with P5(1/32)
  - [-1, 2, C3k2, [768, False]]                      # 21: P5 fused (1/32)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 22: 1/32 → 1/16
  - [[-1, 6], 1, Concat, [1]]                        # 23: with P4(1/16)
  - [-1, 2, C3k2, [512, False]]                      # 24: P4 fused (1/16)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 25: 1/16 → 1/8
  - [[-1, 4], 1, Concat, [1]]                        # 26: with P3(1/8)
  - [-1, 2, C3k2, [256, False]]                      # 27: P3 fused (1/8)

# --- Bottom-Up (PAN) ---
  - [-1, 1, Conv, [256, 3, 2]]                       # 28: 1/8 → 1/16
  - [[-1, 24], 1, Concat, [1]]                       # 29: with P4 fused(24)
  - [-1, 2, C3k2, [512, False]]                      # 30: 1/16 (P4 head)

  - [-1, 1, Conv, [512, 3, 2]]                       # 31: 1/16 → 1/32
  - [[-1, 21], 1, Concat, [1]]                       # 32: with P5 fused(21)
  - [-1, 2, C3k2, [768, False]]                       # 33: 1/32 (P5 head)

  - [-1, 1, Conv, [768, 3, 2]]                       # 34: 1/32 → 1/64
  - [[-1, 18], 1, Concat, [1]]                       # 35: with P6 fused(18)
  - [-1, 2, C3k2, [1024, False]]                      # 36: 1/64 (P6 head)


# --- Detect (P3, P4, P5, P6) ---
  - [[27, 30, 33, 36], 1, Detect, [nc]]              # 37